6HJS/CC2640R2F_BLE5/examples/rtos/CC2640R2_LAUNCHIOT/ble5stack/CPS-GATE-Counter/src/driver/bma250e/hw_bma250e_Spec.h
/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x34 (BMA250_REG_BGW_SPI3_WDT)
#define BMA250_I2C_WDT_EN_FLAG  ((uint8_t)(0x04))   // if I2C interface mode is selected 1・   disables the watchdog at the SDI pin (= SDA for I2C) 
#define BMA250_I2C_WDT_SEL_FLAG ((uint8_t)(0x02))   // select an I2C watchdog timer period  1  50 ms
#define BMA250_SPI3_MODE_FLAG ((uint8_t)(0x02))     // select ・0・  4-wire SPI, or ・1・  3-wire SPI mode 


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x36 (BMA250_REG_OFC_CTRL)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x37 (BMA250_REG_OFC_SETTING)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x38 (BMA250_REG_OFC_OFFSET_X)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x39 (BMA250_REG_OFC_OFFSET_Y)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x3A (BMA250_REG_OFC_OFFSET_Z)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x3B (BMA250_REG_TRIM_GP0)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x3C (BMA250_REG_TRIM_GP1)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x3E (BMA250_REG_FIFO_CONFIG_1)
//<TODO>


/////////////////////////////////////////////////////////////////////////////////////////////////////
// Used with register 0x3F (BMA250_REG_FIFO_DATA)
//<TODO>


#endif //__DRITEK_BMA250_SPEC_H__


